Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: མཇལ་དུམ་བྱས་ཏེ། མགུལ་ནས་འཁྱུད་ནས་བུ་མོ་སྦྱིན་པར་བྱས་ཏེ་རང་གི་ཡུལ་དུ་སོང་ངོ་། །
en: The two kings met, embraced, and King Brahmadatta pledged his daughter and returned to his own country.

source: དེ་རང་གི་ཡུལ་དུ་སོང་བ་དང་བུ་མོ་འདིའི་བཙས་སྟོན་བྱས་ནས། བུ་མོ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་
en: Upon returning to his country, he held an elaborate feast celebrating her birth, and asked, “What name should we give this child?”

source: མིང་འདོག་པར་བྱེད་དེ།
en: And they named her, saying,

source: བུ་མོ་འདི་བཙས་པ་ན་ཡུལ་ཁམས་གཉིས་བདེ་བར་གྱུར་པས་ན་བུ་མོ་འདིའི་མིང་བདེ་བྱེད་མ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since her birth brought happiness to the two kingdoms, her name will be Kṣemaṅkarā (She Who Brings Happiness).”

source: དེ་ནས་བུ་མོ་བདེ་བྱེད་མ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་སོ། །
en: They raised young Kṣemaṅkarā on milk, yogurt, butter, ghee, and milk solids.

source: འདོད་པ་རྣམས་ནི་ཚྭ་ཆུ་དང་མཚུངས་ཏེ་ཇི་ཙམ་དུ་བརྟེན་པ་དེ་ཙམ་དུ་རབ་ཏུ་འཕེལ་བར་འགྱུར་རོ། །
en: Now desires are like salt water—the more you use to slake your thirst, the more you need.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཡང་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་བཙུན་མོ་ལ་བུ་ཆགས་པར་གྱུར་ནས།
en: So one day, King Brahmadatta ’s queen conceived again,

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ་
en: and when nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་ཡང་རྒྱས་པར་བྱས་ནས།
en: They held another elaborate feast, celebrating his birth, and they asked,

source: ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་
en: “What name should we give this child?”

source: མིང་འདོག་པར་བྱེད་དེ། ཁྱེའུ་འདི་སྲིང་མོ་བདེ་བྱེད་མའི་འོག་ཏུ་བཙས་པས་ན། ཁྱེའུ་འདིའི་མིང་བདེ་བྱེད་ཅེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since this child was born after his sibling Kṣemaṅkarā, his name will be Kṣemaṅkara (He Who Brings Happiness).”

source: དེ་ནས་ཁྱེའུ་བདེ་བྱེད་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས་མཚོའི་ནང་གི་པད་མ་ལྟར་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They raised young Kṣemaṅkara on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གཉིས་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་བུ་མོ་བདེ་བྱེད་མ་དང་ཁྱེའུ་བདེ་བྱེད་གཉིས་ཤིན་ཏུ་མཛའ་བར་གྱུར་ཏེ། སྐད་ཅིག་ཙམ་ཡང་གཅིག་མེད་པར་གཅིག་འདུག་མི་ཕོད་དོ། །
en: When they grew up, young Kṣemaṅkarā and Kṣemaṅkara became close friends, and could not bear to be apart for even a moment.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: Then one day King Prasenajit sent an envoy to King Brahmadatta with the message,

source: བུ་མོ་བུ་ལ་བླང་ངོ་ཞེས་སྤྲིང་ངོ་། །
en: “We will receive your daughter now.”

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཀྱང་ཐོས་མ་ཐག་ཏུ། རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཕོ་ཉའི་ལན་བཏང་སྟེ།
en: As soon as King Brahmadatta heard this, he sent an envoy with the message,

source: འདི་ལ་ཐོགས་པ་ཅི་ཡང་མེད་ཀྱིས་ཆེ་གེ་མོ་ཞིག་གི་ཉིན་པར་ཤོག་ཅིག་ཅེས་བྱས་སོ། །
en: “There is nothing preventing this, so please come on such-and-such a date.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཀྱང་དེ་ལྟར་བྱའོ་ཞེས་བྱས་ནས།
en: King Prasenajit responded, “As you wish,”

source: འབྱོར་པ་ཆེན་པོ་དང་རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་ལྡན་པས་ཡུལ་ཀཱ་ཤིར་སོང་ནས། རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཁྱིམ་པ་རྣམས་ཀྱི་ཁྱིམ་པའི་ཆོས་གང་ཡིན་པ་དེ་བཞིན་དུ་བྱས་ནས་བུ་མོ་བྱིན་ནོ། །
en: and with great opulence and a great display of royal power he traveled to Kāśi, where King Brahmadatta handed his daughter to him in accordance with the customs of householders.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བུ་མོ་ཁྱེར་ཏེ་རང་གི་ཡུལ་དུ་ཆས་སོ། །
en: Afterward, King Prasenajit bore the girl back to his own country.

source: དེ་ནས་ཁྱེའུ་བདེ་བྱེད་ཀྱིས་ཕ་མ་ལ་སྨྲས་པ།
en: Young Kṣemaṅkara said to his parents,

source: ཆེ་ཞེ་བདེ་བྱེད་མ་མཆིས་པར་བདག་མཆི་མི་ཕོད་ཀྱིས་བདག་ཀྱང་འདི་དང་ལྷན་ཅིག་མཆིའོ་ཞེས་བྱས་ནས།
en: “I can’t bear to be without my elder sister, Kṣemaṅkarā. I shall be with her again.”

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་ཁྱོད་ནི་ངའི་བུ་གཅིག་པ་སྡུག་ཅིང་ཕངས་པ་རྒྱལ་ཚབ་ཡིན་ཏེ་ང་འདས་པའི་འོག་ཏུ་རྒྱལ་པོ་བྱ་དགོས་སོ། །
en: “My child,” King Brahmadatta replied, “you are my precious, beloved only son—my regent. After I pass away, you will have to become king.

source: དེ་བས་ན་ཁྱོད་ཡུལ་གཞན་དུ་འགྲོར་མི་རུང་ངོ་ཞེས་བྱས་ཏེ།
en: It wouldn’t be right for you to go to another country.”

source: དེ་རྒྱལ་པོས་ལན་མང་དུ་བཀག་ཀྱང་དགག་མ་ནུས་སོ། །
en: Many times the king tried to impede him from going, but he was not able to stop him.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་སྨྲས་པ།
en: Then King Prasenajit said,

source: ལྷ་བདག་གིས་འདི་མིང་སྲིང་གཉིས་བསྐྱང་བར་བགྱིས་མཆི་ཡང་མི་དངོའོ་ཞེས་བྱས་སོ། །
en: “Deva, I shall protect brother and sister both. If he comes it changes nothing,”

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དེ་ལྟར་བྱའོ་ཞེས་བྱས་ནས་དེ་བཏང་ངོ་། །
en: and King Brahmadatta replied, “As you wish.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བུ་མོ་བདེ་བྱེད་མ་དང་ཁྱེའུ་བདེ་བྱེད་གཉིས་ཁྲིད་དེ་མཉན་དུ་ཡོད་པར་སོང་ངོ་། །
en: King Prasenajit took young Kṣemaṅkarā and Kṣemaṅkara both to Śrāvastī.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱིས་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཐ་དད་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་བསླབས་ཏེ།
en: King Prasenajit had the young man study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train,

source: འདི་ལྟ་སྟེ་གླང་པོ་ཆེ་ཞོན་པ་དང་རྟ་ཞོན་པ་དང་མཚོན་ཆ་བཅང་བ་དང་འཕོང་དང་མདུན་དུ་བསྣུར་བ་དང་ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་འབྱུང་བར་བྱ་བ་དང་། ལྕགས་ཀྱུ་བཟུང་བ་དང་། ཞགས་པ་བཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟངས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕང་བ་དང་། སྒྲ་གྲག་པར་འཕང་བ་དང་། གནད་དུ་འཕང་བ་དང་། གདོན་མི་ཟ་བར་ཕོག་པར་བྱ་བ་དང་ཚབས་ཆེར་བཏང་བ་རྣམས་ཀྱང་བསླབས་ནས་གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏོ། །
en: such as how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage. By the time he had been educated in all of these, he was learned in the five fields of knowledge.

source: དེ་ནས་དེ་ནན་ཏུར་མ་བྱས་པས་མ་གྲངས་ཏེ་འཕྱོན་མ་ལ་ཡང་ཞུགས་སོ། །
en: Now the young man was unruly and careless, and he had intercourse with a sex worker.

source: དེས་ཡུལ་དེར་ཚུལ་མ་ཡིན་པ་བརྒྱ་ཙམ་བྱས་ཏེ། རྒྱལ་པོ་གསལ་རྒྱལ་དང་སྲིང་མོ་བདེ་བྱེད་མས་ལན་མང་དུ་བཀག་ཀྱང་དགག་པར་མ་ནུས་ནས།
en: He broke some one hundred of the country’s laws, and though his sister Kṣemaṅkarā and King Prasenajit tried, they were not able to stop him.

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་པོ་ཚངས་བྱིན་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: Finally King Prasenajit sent an envoy to King Brahmadatta with the message,

source: ཁྱོད་ཀྱི་བུ་འདི་ན་འདུག་པས་མི་རིགས་པ་བརྒྱ་ཙམ་བྱས་ཏེ་དགག་ཀྱང་མ་ནུས་སོ་ཞེས་སྤྲིང་ངོ་། །
en: “Since your son has been here, he has done about a hundred vulgar things, and though we have tried, we have not been able to stop him.”

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཐོས་མ་ཐག་ཏུ་བུ་ལ་སྤྲིང་བ།
en: Immediately upon hearing this, King Brahmadatta sent a message to his son:

source: བུ་ཁྱོད་འོ་ནིར་མ་འདུག་པར་འདིར་ཤོག་ཅིག །
en: “My child, come back here. Don’t stay there anymore.

source: ང་འདས་པའི་འོག་ཏུ་རྒྱལ་པོའི་དབང་ཕྱུག་གི་མངའ་བདག་བྱ་དགོས་ཀྱིས།
en: After my death it will be necessary for you to take on the dominion of the king.

source: མི་རིགས་པ་མ་བྱེད་པར་འདིར་འདུག་ཅིག་ཅེས་བྱས་སོ། །
en: Don’t act in such a vulgar manner. Live here.”

source: འོན་ཀྱང་དེ་ཕས་སྤྲིང་བ་ལྟར་རང་གི་ཡུལ་དུ་ཡང་མ་འོངས།
en: Still, Kṣemaṅkara ignored his father’s message and did not return to his country.

source: བག་མེད་པ་དེ་དག་ཀྱང་མ་སྤངས་ནས། དེ་གང་གི་ཚེ་དགག་པར་མ་ནུས་པ་དེའི་ཚེ་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་བུ་མ་ཡིན་པར་བསྒྲགས་སོ། །
en: After he refused to give up his careless ways, King Brahmadatta , unable to stop him, finally disowned him.

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཀྱང་སྤངས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཡོང་དུ་མ་གནང་ངོ་། །
en: King Prasenajit also gave up on him and no longer permitted him to enter the royal palace.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འགྲོ་འདོད་པ་ལས་ཆབ་སྒོ་བས་བཀག་པ་དང་ནན་གྱིས་ནང་དུ་སོང་སྟེ།
en: One day he wished to enter the royal palace, and though the doorkeeper physically restrained him, he forced his way inside.

source: སྲིང་མོ་དང་ཕྲད་པར་བྱའོ་ཞེས་ཟེར་ཞིང་བཙུན་མོའི་སྒོར་འདུག་གོ། །
en: “I will see my sister!” he insisted, and took a seat at the queen’s door.

source: རྒྱལ་པོ་གསལ་རྒྱལ་ཡང་བཙུན་མོ་བདེ་བྱེད་མ་དང་ལྷན་ཅིག་ཏུ་པི་བང་ལེན་ཅིང་འདུག་གོ། །
en: King Prasenajit and Queen Kṣemaṅkarā were inside playing lutes,

source: དེ་ནས་ཁྱེའུ་བདེ་བྱེད་ཀྱིས་ཚོར་ནས་ཁྱེའུ་དེའི་ལག་ཏུ་མདའ་གཞུ་ཡང་བཅང་སྟེ།
en: and young Kṣemaṅkara, bow in hand, overheard them.

source: དེ་ཁྲོས་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གསད་པའི་ཕྱིར་མདའ་འཕངས་པ་ལས་མདའ་དེས་པི་བང་གི་རྒྱུད་བཅད་དེ་ས་ལ་ལྟུང་ངོ་། །
en: In anger he let loose an arrow, hoping to kill King Prasenajit. The arrow severed a string of the king’s lute and fell to the ground.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་དེ་མཐོང་མ་ཐག་ཏུ་འཇིགས་ཤིང་སྐྲག་སྟེ་
en: As soon as King Prasenajit saw this he fled in terror.

source: བྲོས་ནས་ཤས་ཆེར་ཁྲོས་ཏེ་དེས་བསམས་པ།
en: Then, seething with anger, he thought,

source: གལ་ཏེ་བདག་གིས་འདི་གྱིན་དས་བསད་ན་ནི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཀྱང་ཁྲེལ་བར་འོང་གིས།
en: “If I kill him in some ordinary manner, King Brahmadatta too will come to shame.

source: འདི་བདག་གིས་ཤགས་ཀྱིས་ཕམ་པར་བྱས་ཏེ་གསད་པར་བྱའོ་སྙམ་མོ། །
en: So I will convict him in a court of law and have him executed.”

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ལུགས་ཀྱིས་ན། གལ་ཏེ་དོན་ཆུང་ངུ་ཞིག་གི་ཕྱིར་ཤགས་འགྱེད་ན་ནི་དུང་སྒྲིལ་མ་འབུད་དུ་འཇུག་གོ། །
en: It was King Prasenajit’s custom that when a trial was to be held, if the dispute was trivial, two intertwined conches were sounded,

source: དེ་སྟེ་ཤགས་ཆེན་པོ་ཞིག་འགྱེད་ན་ནི་དེའི་ཚེ་རྔ་བོ་ཆེ་ཡང་རྡུང་ལ་དུང་སྒྲིལ་མ་ཡང་འབུད་དུ་འཇུག་སྟེ།
en: and if the dispute was grave, the two intertwined conches were sounded over the beating of a great drum.

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྣམ་པ་གཉིས་ཀ་བྱེད་དུ་བཅུག་ནས།
en: In this case King Prasenajit had them sound both.

source: ཐོས་མ་ཐག་ཏུ་མཉན་ཡོད་ན་མིའི་གཙོ་བོ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འདུས་ཏེ།
en: As soon as this was heard, every high functionary in Śrāvastī gathered in the royal palace.

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་པོའི་བུ་དེ་ཤགས་ཀྱིས་ཕམ་པར་བྱས་ནས། ཀ་ར་བཱི་རའི་མེ་ཏོག་གི་ཕྲེང་བས་མགུལ་པ་དཀྲིས་ཏེ་གཤེད་མ་ལ་གཏད་ནས།
en: King Prasenajit convicted the young man in court, draped his neck with garlands of oleander flowers, and handed him over to the executioners.

source: གཤེད་མའི་མི་གོས་སྔོན་པོ་བགོས་ལ་རལ་གྲི་ཕྱུང་སྟེ་རྔ་སྒྲ་དྲག་པོར་སྒྲོགས་པ་དག་གིས་ཁྲིད་ནས། ལམ་པོ་ཆེའི་མདོ་རྣམས་སུ་བསྒྲགས་ཏེ་
en: Clad in black , the executioners unsheathed their swords, and with a thundering of drums they led him to the crossroads on the main highway.

source: གསོད་པའི་སར་ཕྱིན་དུ་ཉེ་བ་དང་། ཁྱེའུ་བདེ་བྱེད་སྙིང་རྗེ་རྗེ་སྐད་དུ་བླ་ཞིང་ཕན་ཚུན་དུ་ལྟ་སྟེ།
en: As they neared the place where he was to be executed, young Kṣemaṅkara cried for mercy, flailed all about, and thought,

source: བདག་ཕོངས་ཤིང་དཀོས་ཐག་པ་དང་སྡུག་པའི་སྐྱབས་བྱེད་པ་དང་སྲོག་ཕངས་པ་སྦྱིན་པ་སུ་ཞིག་ཡོད་ཅིག་གུ་སྙམ་མོ། །
en: “Who can protect me from such desolation, distress, and suffering? Who can save my precious life?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་བདེ་བྱེད་གདུལ་བའི་དུས་ལ་བབ་བོ་སྙམ་དུ་དགོངས་ཏེ།
en: The Blessed One knew that the time had come to tame young Kṣemaṅkara,

source: ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ནས་ལྷུང་བཟེད་བསྣམས་ཏེ་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་གཤེགས་ནས།
en: so he donned his lower garment and Dharma robes, and, carrying his alms bowl, went for alms in Śrāvastī.

source: ཁྱེའུ་བདེ་བྱེད་ཀྱིས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: Young Kṣemaṅkara saw the Blessed One in the distance.

source: མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་སོང་སྟེ།
en: Upon seeing him, he approached the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས།
en: bowed down at the Blessed One’s feet, and pleaded,

source: བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ནི་དཀའ་བ་མཛད་ཅིང་སྲོག་ཕངས་པ་སྩོལ་བ་ལགས་སོ། །
en: “Blessed One, Blessed One, please take on the difficult task of saving my precious life!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་མ་འཇིགས་ཤིག་ད་ཁྱོད་ཀྱི་སྲོག་ཆུད་ཟ་བར་མི་འགྱུར་རོ། །
en: “Young man,” the Blessed One said, “don’t be afraid. Your life will not be lost.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཤེད་མའི་མི་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke to the executioners, saying,

source: བཞིན་བཟངས་དག་གཞོན་ནུ་འདི་ཐོང་ཤིག །
en: “My friends, release this young man.”

source: གཤེད་མ་རྣམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་མགོ་གཉིས་མཆིས་སམ་ཅི་ན་བདག་ཅག་གིས་ཁྱེའུ་འདི་གཏང་བར་བགྱི།
en: “Do we look to you like we have spare heads?” the executioners replied. “How can we release him, Blessed One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་བཀའ་སྩལ་པ། བཞིན་བཟངས་དག་ང་རྒྱལ་པོ་དང་མ་ཕྲད་ཀྱི་བར་དུ་རེ་ཞིག་ཟུང་ཤིག །
en: “My friends,” the Blessed One requested, “hold him a little while, until I have met with the king.”

source: དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་བཞིན་དུ་འཚལ་ལོ། །
en: “As you wish, Blessed One,” they replied.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རྒྱལ་པོ་གསལ་རྒྱལ་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས།
en: So the Blessed One went to see King Prasenajit.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Upon arriving, the Blessed One addressed the king, saying,

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱེའུ་དེ་ཐོང་ཤིག །
en: “Great King, release this young man.”

source: རྒྱལ་པོས་གསོལ་པ། བཙུན་པ་གལ་ཏེ་རབ་ཏུ་འབྱུང་བ་ན་ནི་གཏང་བར་འཚལ་ལོ་ཞེས་གསོལ་ནས།
en: “Lord,” the king replied, “if he goes forth, I shall release him.”

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་གསད་པ་ལས་བཟློག་སྟེ་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ནས།
en: At that, King Prasenajit countermanded his execution and offered him to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཁྲིད་དེ་རབ་ཏུ་ཕྱུང་ཞིང་བསྙེན་པར་རྫོགས་པར་མཛད་ནས། དེ་ལ་ལུང་ཡང་ཕོག་སྟེ་
en: The Blessed One took the young man to the garden of Prince Jeta, led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེས་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, he manifested arhatship.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་རྒྱལ་པོའི་བུ་བདེ་བྱེད་མ་གྲངས་ཏེ་གསོད་དུ་བཏང་བ་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཐར་བར་མཛད་དེ། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལ་འདས་པ་ལ་གཞག་པ་ལ་གཟིགས།
en: “Lord,” the monks requested the Blessed One, “please tell us why the unruly Prince Kṣemaṅkara had been sent to his death, and the Blessed One rescued him and established him in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་འདི་མ་གྲངས་ཤིང་གཡེམ་པར་གྱུར་ནས་ཚངས་པས་བྱིན་གྱིས་གསོད་དུ་བཏང་བ་ལས།
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, he was unruly and committed sexual misconduct, Brahmadatta sent him to be executed,

source: ངས་སྐྱབས་བྱས་ཏེ། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་ཇི་ལྟར་བཞག་པ་དེ་ཉོན་ཅིག །
en: and I rescued him, placing him in the four meditative states and five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་རྒྱལ་པོ་བྱེད་དེ། དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་དེ་ཉིད་ན་མི་ཞིག་མ་གྲངས་ཤིང་གཡེམ་སྟེ།
en: “Monks, in times past during King Brahmadatta’s reign in the city of Vārāṇasī, there lived a certain man in Vārāṇasī who was unruly and lascivious, and who had the whole city in turmoil.

source: གཞི་དེ་ལས་གྲོང་ཁྱེར་པ་རྣམས་འཁྲུགས་ནས་སྐྱེ་བོ་མང་པོ་རྣམས་ཀྱིས་དེ་བཟུང་སྟེ། རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་ཕུལ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་གསོད་དུ་བཏང་སྟེ།
en: A crowd seized him and presented him to King Brahmadatta, and King Brahmadatta sent him to be executed.

source: དེ་གཤེད་མ་རྣམས་ཀྱིས་ཁྲིད་ནས་གསད་པའི་སར་ཕྱིན་ཏེ། དེ་གསད་པས་འཇིགས་སྐྲག་ནས་ཕན་ཚུན་ལྟ་ཞིང་འདུག་སྟེ།
en: As the executioners were carrying him to the spot where he was to be executed, he became terrified of being executed and looked all about, thinking,

source: བདག་ལ་དཀའ་བ་བྱེད་པ་དང་སྲོག་ཕངས་པ་བྱིན་པར་བྱེད་པ་སུ་ཞིག་ཡོད་ཞིག་གུ་སྙམ་མོ། །
en: ‘Who can take on the difficult task of saving my precious life?’

source: དེ་ནས་དེའི་ཚེ་བཱ་རཱ་ཎ་སཱིའི་ཕྱོགས་ཤིག་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་ཡོད་པ་དེ་བཱ་རཱ་ཎ་སཱིར་སྤྱོད་ཡུལ་ལ་སོང་བ་ལས་མི་དེས་མཐོང་སྟེ
en: “At that time, there was a certain sage living in the Vārāṇasī area who had all the five superknowledges and was a person of great miracles and great power. The man saw him approaching the vicinity of Vārāṇasī,

source: མཐོང་མ་ཐག་ཏུ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: and as soon as he saw him, he bowed down at his feet and said,

source: དྲང་སྲོང་དག་བདག་ལ་དཀའ་བ་མཛད་ཅིང་སྲོག་ཕངས་པ་སྩལ་བར་གསོལ་ཞེས་བྱས་སོ། །
en: ‘Sage, please undertake the difficult task of saving my precious life.’

source: དེ་ནས་དྲང་སྲོང་དེས་གཤེད་མ་རྣམས་ལ་སྨྲས་པ། བཞིན་བཟངས་དག་མི་འདི་མ་གསད་པར་ཐོང་ཤིག །
en: “ ‘My friends,’ the sage told the executioners, ‘do not kill him. Release him instead.’

source: གཤེད་མ་རྣམས་ཀྱིས་སྨྲས་པ། དྲང་སྲོང་བདག་ཅག་ལ་མགོ་བོ་གཉིས་མཆིས་སམ་ཅི་ན། བདག་ཅག་གིས་འདི་བཏང་བར་བགྱི།
en: “ ‘Do we look to you like we have spare heads?’ the executioners replied. ‘How can we release him, sage?’

source: དྲང་སྲོང་གིས་སྨྲས་པ། ང་རྒྱལ་པོ་དང་མ་ཕྲད་ཀྱི་བར་དུ་རེ་ཞིག་ཟུང་ཤིག་ཅེས་བྱས་ནས།
en: “The sage said, ‘Hold him a little while, until I have met with the king.’

source: དྲང་སྲོང་དེ་རྒྱལ་པོ་ཚངས་པས་བྱིན་ག་ལ་བ་དེར་སོང་ནས་སྨྲས་པ།
en: Then the sage went to see King Brahmadatta and implored him,

source: རྒྱལ་པོ་ཆེན་པོ་མི་དེ་མ་གསད་པར་ཐོང་ཤིག །
en: ‘Great king, do not kill this man. Release him instead.’

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་སྨྲས་པ། དྲང་སྲོང་གལ་ཏེ་རབ་ཏུ་འབྱུང་ན་ནི་བཏང་བར་བགྱིའོ་ཞེས་བྱས་ནས་
en: “ ‘Sage,’ King Brahmadatta replied, ‘if he goes forth, I shall release him.’

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་མི་དེ་ཕྲིན་གྱིས་གསད་པ་ལས་བཟློག་སྟེ་དྲང་སྲོང་དེ་ལ་ཕུལ་ནས
en: At that, King Brahmadatta sent a message countermanding the execution order and offered him to the sage.

source: དྲང་སྲོང་དེས་དཀའ་ཐུབ་ཀྱི་གནས་སུ་ཁྲིད་དེ་རབ་ཏུ་བྱུང་ནས་ལུང་ཡང་ཕོག་གོ། །
en: The sage brought him to a hermitage, led him to go forth, and instructed him.

source: མི་དེས་ཀྱང་དཀའ་ཐུབ་ཀྱི་གནས་དེ་ཉིད་ན་འདུག་བཞིན་དུ་བསམ་གཏན་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: While staying in that very hermitage, the man generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་དྲང་སྲོང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཡིན་ནོ། །
en: I am the one who was that sage then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་མི་གང་ཡིན་པ་དེ་ནི་ཁྱེའུ་བདེ་བྱེད་ཡིན་ནོ། །
en: The one who was that man then is none other than this young man.

source: དེའི་ཚེ་རྒྱལ་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། རྒྱལ་པོ་གསལ་རྒྱལ་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was the king then is now King Prasenajit himself.

source: དེའི་ཚེ་ཡང་དེས་འདི་གསོད་དུ་བཏང་བ་ལས་ངས་སྐྱབས་བྱས་ཏེ། རབ་ཏུ་ཕྱུང་ནས་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཞག་གོ། །
en: At that time he sent the man to be executed, and I rescued him, led him to go forth, and placed him in the four meditative states and the five superknowledges.

source: ད་ཡང་འདི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་གསོད་དུ་བཏང་བ་ལས་ངས་བསྐྱབས་ཏེ། གཡུང་དྲུང་གི་མཐར་ཐུག་པའི་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་གོ། །
en: Now as well he was sent to be killed by King Prasenajit, and I rescued him and established him in the unsurpassed, supreme welfare of nirvāṇa.”

source: གསོལ་པ། བཙུན་པ་གཞོན་ནུ་བདེ་བྱེད་ཀྱིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ་
en: “Lord,” the monks asked, “what action did Prince Kṣemaṅkara take that ripened into his birth into a family of great means, prosperity, and wealth,

source: བཅོམ་ལྡན་འདས་ཀྱང་འདིས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: and that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་ནས་དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་ཏེ།
en: he went forth in his doctrine and acted as steward for the monks.

source: དེས་དེར་ཆོས་བཞིན་དུ་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱས་ནས། བྱམས་པའི་སེམས་ཀྱིས་ཏིང་ངེ་འཛིན་ཀྱང་བསྐྱེད་དོ། །
en: “He acted as steward of the saṅgha in accord with the Dharma, and progressed in meditative stabilization on love.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་ནས་
en: He practiced pure conduct all his life,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ། བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དགེ་སློང་ཞལ་ཏ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་རྒྱལ་པོའི་བུ་བདེ་བྱེད་འདི་ཉིད་ཡིན་ཏེ།
en: “Monks, what do you think? The monk who acted as steward then is now none other than Prince Kṣemaṅkara.

source: དེས་དེར་ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་པ་དང་བྱམས་པའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་བསྒོམས་ཤིང་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: At that time he acted as steward in accord with the Dharma, cultivated the meditative stabilization on love, and at the time of his death, he prayed,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ། གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པས་ན།
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: དེས་དེར་ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་པ་དེས་ནི། ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་སོ། །
en: “By acting as steward in accord with the Dharma he was born into a family of great means, prosperity, and wealth.

source: དེས་བྱམས་པའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་བསྒོམས་པ་དེས་ན། གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཏོ།། །།
en: He cultivated the meditative stabilization on love, and so he was well proportioned, pleasing to the eye, and beautiful.”

source: གདོལ་པའི་ཁྱེའུ་ཞེས་བྱ་བ་ནི།
en: The Young Untouchable

source: བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་གྱེན་དུ་རྒྱལ་ཞེས་བྱ་བ་ན། གྲོང་གི་བྱང་ཕྱོགས་ཤིང་ཤ་པའི་ཚལ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཡུལ་གྱེན་དུ་རྒྱལ་ན་རྒྱལ་པོ་རབ་སྣང་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དོ། །
en: When the Blessed One was dwelling near the city of Ujjayinī, in Śiṃśapā forest north of town, King Pradyota reigned in Ujjayinī,
